Repository: Modus-Exciter/NDTM
Catalog: source/Notung/Properties/Resources.*.resx
Languages: ru

# CONTEXT_KEY_RESERVED
source: Key '{0}' is reserved
ru: Ключ '{0}' зарезервирован

# DUPLICATE_SECTION_NAME
source: Another configuration section {0} already has the same name as {1}
ru: Другая конфигурационная секция {0} имеет то же имя, что и {1}

# EMPTY_DEFAULT_LOGGER
source: Default logger cannot be empty or whitespace
ru: Логгер по умолчанию не может быть пустым или состоять только из пробельных символов

# GRAPH_CYCLE
source: Arc cycle detected. Unable to perform topological sort
ru: В графе обнаружен цикл. Топологическая сортировка невозможна

# GRAPH_MUST_BE_ORIENTED
source: Graph must be oriented for topologogical sort
ru: Граф должен быть ориентированным для топологической сортировки

# INVALID_CONFIG_SECTION_TYPE
source: Configuration section must be a non-abstract class with paramrterless constructor and inherited from Toolbox.Configuration.ConfigurationSection
ru: Конфигурационная секция должна быть неабстрактным классом с конструктором без параметров, унаследованным от Toolbox.Configuration.ConfigurationSection

# INVALID_EVENT_HANDLER
source: Delegate type {0} is not recognized as EventHandler<{1}>
ru: Тип делегата {0} не совпадает с типом EventHandler<{1}>

# INVALID_PLUGIN_FILE
source: File {0} is not a correct plugin file
ru: Файл {0} не является корректным плагином

# PLUGIN_NOT_FOUND
source: Assembly {0} specified in plugin file {1} does not exist
ru: Сборка {0}, указанная в файле плагина {1}, не существует

# SECTION_TYPE_UNINHERITABLE
source: Unable to save inherited section. Expected type {0}, actual type {1}
ru: Невозможно сохранить унаследованную секцию. Требуется тип {0}, передан {1}

# SETTINGS_RESTORE
source: Settings restore started
ru: Запущено восстановление настроек

source: Stream flush
ru: Сообщение потока

# SUMMARY_ERROR
source: Some critical errors leaded to stop. View detail descripton for all messages to explain
ru: Произошло несколько критических ошибок, приведших к останову. Просмотрите детальную информацию

# SUMMARY_INFO
source: These messages contain only information and does not require anithing to do
ru: Эти сообщения носят информационный характер и не требуют никакх дополнительных действий

# SUMMARY_WARNING
source: Read these warnings and fix the problems detected
ru: Прочтите предупреждающие сообщения и примите необходимые меры

# THREAD_CONTEXT_MISMATCH
source: Thread context can be edited only in thread where it was created
ru: Контекст потока может быть изменён только из того потока, где он был создан

# UNLOADING_PLUGIN_CURRENT_DOMAIN
source: Unable to unload plugin from the current appliation domain
ru: Невозможно выгрузить плагин из текущего домена приложения

# UNLOAD_PLUGIN_NO_CONTAINER
source: This plugin was not loaded correctly. It cannot be unloaded
ru: Этот плагин не был корректно загружен. Он не может быть выгружен

# WRONG_FILE_SYMBOLS
source: File name contains wrong symbols
ru: Имя файла содержит недопустимые знаки
